Revit 2027 API
ScheduleSortGroupField.ShowFooterTitle Property
 Indicates if the footer row should display a title.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowFooterTitle { get; set; }
Public Property ShowFooterTitle As Boolean
	Get
	Set
public:
property bool ShowFooterTitle {
	bool get ();
	void set (bool value);
}
member ShowFooterTitle : bool with get, set
Property Value
Boolean
 True if a title should be displayed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Display of footer rows is not enabled.
Remarks
The title consists of the value of the field that the schedule is grouped by.
ShowFooterTitle can only be enabled if ShowFooter is enabled.
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace